app/views/countdown/index.html.haml

    Countdown for
    = select_tag(:user_id, options_from_collection_for_select(User.all, :id, :first_name, @entitlement.user.id), id: 'countdown_user_id')
---
SELECT "users".* FROM "users"