app/controllers/countdown_controller.rb

SELECT "users".* FROM "users"
---
  def index
    user = User.find_by_first_name('Riana')
    @entitlement = user.entitlements.first