app/controllers/stays_controller.rb

SELECT  "stays".* FROM "stays"  ORDER BY "stays"."id" DESC LIMIT 1
---
  def index
    @stays = Stay.all

INSERT INTO "stays" ("time_to_qualify", "entry_date", "exit_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["time_to_qualify", 4], ["entry_date", "2011-03-11"], ["exit_date", "2011-04-11"], ["created_at", "2015-05-11 01:40:08.644913"], ["updated_at", "2015-05-11 01:40:08.644913"]]
---
  def create
    stay = Stay.new(stay_params)
    stay.save!

SELECT  "stays".* FROM "stays" WHERE "stays"."id" = $1 LIMIT 1  [["id", 12]]
DELETE FROM "stays" WHERE "stays"."id" = $1  [["id", 12]]
---
  def destroy
    stay = Stay.find(params[:id])
    stay.destroy