app/controllers/users_controller.rb

SELECT "entitlements".* FROM "entitlements"
---
  def new
    @user = User.new
    @user.entitlements.build
    @user.entitlements.first.stays.build

INSERT INTO "users" ("first_name", "surname", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Fuzzy"], ["surname", "Lumpkin"], ["email", "fuzzy@gmail.com"], ["created_at", "2015-05-12 06:12:32.369815"], ["updated_at", "2015-05-12 06:12:32.369815"]]
---
  def create
    @user = User.new(user_params)

    if @user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "entitlements".* FROM "entitlements" WHERE "entitlements"."user_id" = $1  ORDER BY "entitlements"."id" ASC LIMIT 1  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @entitlement = @user.entitlements.first